api/models/Project.php

    public function getProject(){
        $project_id = UserProject::find()->where(['user_id'=>Yii::$app->user->id])->select('project_id')->asArray()->all();
---
SELECT `project_id` FROM `hl_user_project` WHERE `user_id`=2