api/models/SignupForm.php

INSERT INTO `hl_user` (`username`, `password_hash`, `auth_key`) VALUES ('gjb', '$2y$13$9GXx9DvwXbKSjiZ5fLykQO9z2tDLKX4GIyd82ebNmD64TpjKmb1KW', 'G1DEtI2B3N7Be88QPTo1Opd2ZDv3SVYB')
---
    public function signup()
    {
        if ($this->validate()) {
            $user = new User();
            $user->username = $this->username;
            $user->setPassword($this->password);
            $user->generateAuthKey();
            if ($user->save()) {