api/models/User.php

    public static function findByUsername($username)
    {
        return static::findOne(['username'=>$username]);
---
SELECT * FROM `hl_user` WHERE `username`='gjb'

    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id]);
---
SELECT * FROM `hl_user` WHERE `id`=3