api/models/UserProject.php

    public static function getProjects($user_id)
    {
        return self::find()->where(['user_id'=>$user_id,'role'=>1])->select('project_id')->asArray()->all();
---
SELECT `project_id` FROM `hl_user_project` WHERE (`user_id`=3) AND (`role`=1)